#define _CRT_SECURE_NO_WARNINGS 1
#pragma warning(disable:6031)
//#include<stdio.h>

//位操作符  //操作数必须为整数
//int main()
//{
//	//'&'    '|'     '^'
//
//	//逻辑与操作符
//	int a = 3;                                  //逻辑与操作符，按二进制位逻辑与，有0出0
//	int b = 5;                                  //a 00000000000000000000000000000011
//	int c = 3 & 5;                           //b 00000000000000000000000000000101
//	printf("%d\n", c);                        //c  00000000000000000000000000000001  =1
//
//
//	int d = a | b;
//	printf("%d\n", d);                       //逻辑或操作，按二进制位逻辑或，有1出1
//	                                                //a 00000000000000000000000000000011
//	                                                //b 00000000000000000000000000000101
//	                                                //c 00000000000000000000000000000111  =7
//
//
//	//逻辑异或，二进制逻辑异或，相同输出真（0），不同输出假（1）
//	 //a 00000000000000000000000000000011
//     //b 00000000000000000000000000000101
//     //e 00000000000000000000000000000110  =6
//	int e = a ^ b;
//	printf("%d\n", e);
//	return 0;
//}
//异或的具体实用题
//不使用第三个变量交换两个数的值
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//第一种实现的简单方法
//	/*printf("a=%d  b=%d\n",a,b);
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("a=%d  b=%d\n", a, b);*/
//	//该方法可以实现，但是由于int储存的数字的大小有限，当a+b足够大时，会到值它们的和溢出
//
//
//	//第二种实现方法用异或
//	printf("a=%d  b=%d\n", a, b);
//	a = a ^ b;//a  011   b 101  此时a =110   b=101
//	b = a ^ b;//a 110   b  101  此时b =011   a=110
//	a = a ^ b;//a 110   b  011  此时a = 101(5）   b=011（3）
//	printf("a=%d  b=%d\n", a, b);
//	return 0;
//}