#define _CRT_SECURE_NO_WARNINGS 1
#pragma warning(disable:6031)
//将二进制数的某一位数变成1
//#include<stdio.h>
//int main()
//{
//	int a = 5;//a 00000000000000000000000000000101；
//	int n = 8;
//	//将a的第24位变成1；
//	//思路：  00000000000000000000000000000101
//	//逻辑或  00000000000000000000000100000000
//	//这样就可以让a的第n位变成1
//	//但是怎么简单的生成需要逻辑或的这个数呢，用”<<“
//	int b = a | (1 << (32 - n));
//	printf("%d\n", b);
//
//
//	return 0;
//}



//将二进制数的某一位数变成0
//#include<stdio.h>
//int main()
//{
//	int a = 13;//                                              a 00000000000000000000000000001101
//	//想要将a的第29位数修改成0；那么 逻辑与11111111111111111111111111110111
//	//关键的问题是如何简单的生成11111111111111111111111111110111这个数呢
//	//那么就用按二进制位取反操作符’~‘
//	//那么我们要生成的数就是00000000000000000000000000001000；
//	//那么通过<<操作符可简单的生成
//	int n = 29;
//	int b = a & (~(1 << (32 - n)));
//	printf("%d\n", b);
//
//
//
//	return 0;
//}