#define _CRT_SECURE_NO_WARNINGS 1
#pragma warning(disable:6031)
//#include<stdio.h>
//int main()
//{
//	//左移操作符<<
//	int a = 10;
//	int b = a << 1;//左移操作就是将他的二进制数整体移动n位，溢出的位数删除，缺少的位数补0；
//							//左移几位就是  a*2的n次方
//	printf("%d\n", b);
//
//	//右移操作符
//	int c = 20;
//	int d = c >> 1;
//	printf("%d\n", d);//正数的右移就是二进制整体移动n位，溢出的数删除，缺少的位数补0
//
//	//但是右移有两种情况，1.算数右移，即缺少的位数补上符号位
//										//2.逻辑右移，即缺少的位数直接补上0
//	//负数的右移
//	//负数在存储中以反码的形式存储
//	//以-1为例     源码为：10000000000000000000000000000001
//						//反码为：11111111111111111111111111111110（符号位不变，其他按位取反）
//						//补码为：11111111111111111111111111111111（反码+1）
//	//算数右移的情况-1应该是11111111111111111111111111111111（负数）
//	//逻辑右移的情况-1应该是01111111111111111111111111111111（正数）
//
//	int e = -1;
//	int f = e >> 1;
//	printf("%d\n", e);//e输出为-1；即负数采用算数右移，补符号位
//	return 0;
//}