#define _CRT_SECURE_NO_WARNINGS 1
#pragma warning(disable:6031)

//#include<stdio.h>
//
//int main()
//{
//	int aa[2][5] = { 1,2,3,4,5,6,7,8,9,10 };
//	int* ptr1 = (int*)(&aa + 1);
//	//取地址aa，取整个数组的地址，&aa+1即指针指到了数组的最末尾
//	int* ptr2 = (int*)(*(aa + 1));
//	//aa这个地方没有取地址，也没单独存在，表示数组首元素的地址，二维数组首元素为第一个一维数组，
//	//aa+1，即第二个元素的地址，即第二个数组，然后解引用第二个数组的地址，即解引用到6
//	//将6强制转换成指针，即指针指向6的地址
//	printf("%d,%d", *(ptr1 - 1), *(ptr2 - 1));
//	//ptr1 -1,指指针后移一位，然后解引用，则为10
//	//指向6的指针后移一位，指向5.
//	return 0;
//}